//百钱买百鸡问题。
//我国古代数学家张丘建在《算经》一书中提出的数学问题：
//鸡翁一值钱五，鸡母一值钱三，鸡雏三值钱一。百钱买百鸡;
//问鸡翁、鸡母、鸡雏各几何？
//解：
//设鸡翁数量为x,鸡母数量为y，鸡雏数目为z；
//可得到方程式:
//x+y+z=100
//5x+3y+z/3=100 -> 15x+9y+z=300
//100-x-y=300-15x-9y -> 100=7x+4y
//进行编程实现：
#include<stdio.h>
int main()
{
    int x,y,i,j;
    for(i=0;i<100;i++)
    {
        x=i;
        for (j = 0; j < 100; j++)
        {
            y=j;
            if(7*x+4*y==100)
            {
                printf("鸡翁有%d只,鸡母有%d只,雏鸡有%d只\n",x,y,100-x-y);
            }
        }
        
    }
    return 0;
}